# IsAlmostZero Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MathComparisonUtils..::..IsAlmostZero Method
MathComparisonUtils Class See Also
---
Checks if value is almost zero, using the internal tolerance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static bool IsAlmostZero(
	double value
)
```

Visual Basic
---
```text
Public Shared Function IsAlmostZero ( _
	value As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAlmostZero(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double The value to check.
# ### Return Value
True if value is almost zero, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value for value is not finite |

# See Also
MathComparisonUtils Class
Autodesk.Revit.DB Namespace